[
    {
        "group": 1,
        "word": "abound",
        "definition": "exist in large numbers or amounts",
        "example": "Opportunities to learn and grow abound in this supportive environment."
    },
    {
        "group": 1,
        "word": "amorphous",
        "definition": "without a clearly defined shape or form",
        "example": "Her amorphous ideas lacked structure and were difficult to grasp."
    },
    {
        "group": 1,
        "word": "austere",
        "definition": "severe or strict in manner, attitude, or appearance",
        "example": "The monk lived an austere life, owning little and speaking sparingly."
    },
    {
        "group": 1,
        "word": "belie",
        "definition": "fail to give a true notion or impression of something",
        "example": "His calm demeanor belies the storm of emotions within him."
    },
    {
        "group": 1,
        "word": "capricious",
        "definition": "given to sudden and unaccountable changes of mood or behavior",
        "example": "Her capricious nature made it hard for others to predict her actions."
    },
    {
        "group": 1,
        "word": "cerebral",
        "definition": "intellectual rather than emotional or physical",
        "example": "His cerebral approach to problem-solving impressed his colleagues."
    },
    {
        "group": 1,
        "word": "congenial",
        "definition": "pleasant or agreeable",
        "example": "She found the small town's congenial atmosphere comforting."
    },
    {
        "group": 1,
        "word": "conspicuous",
        "definition": "standing out so as to be clearly visible",
        "example": "Her bright red hat made her conspicuous in the sea of black coats."
    },
    {
        "group": 1,
        "word": "cursory",
        "definition": "hasty and therefore not thorough or detailed",
        "example": "He gave the report only a cursory glance before the meeting."
    },
    {
        "group": 1,
        "word": "daunting",
        "definition": "seeming difficult to deal with in anticipation; intimidating",
        "example": "The daunting task of writing a novel discouraged her at first."
    },
    {
        "group": 1,
        "word": "deify",
        "definition": "worship or regard as a god",
        "example": "In some cultures, heroes of the past are deified and honored."
    },
    {
        "group": 1,
        "word": "didactic",
        "definition": "intended to teach, particularly in having moral instruction as an ulterior motive",
        "example": "The novel's didactic tone was evident in its emphasis on social justice."
    },
    {
        "group": 1,
        "word": "disseminate",
        "definition": "spread or disperse widely",
        "example": "The organization aims to disseminate knowledge about climate change."
    },
    {
        "group": 1,
        "word": "feasible",
        "definition": "possible to do easily or conveniently",
        "example": "The proposed plan seemed feasible given the available resources."
    },
    {
        "group": 1,
        "word": "flout",
        "definition": "openly disregard a rule, law, or convention",
        "example": "She was known to flout the rules whenever she thought they were unjust."
    },
    {
        "group": 1,
        "word": "homogeneous",
        "definition": "of the same kind; alike",
        "example": "The company aimed for a homogeneous workforce to promote unity."
    },
    {
        "group": 1,
        "word": "humdrum",
        "definition": "lacking excitement or variety; dull",
        "example": "Their humdrum routine made them long for a change in scenery."
    },
    {
        "group": 1,
        "word": "insipid",
        "definition": "lacking flavor; weak or tasteless",
        "example": "The soup was insipid, lacking the spices that would have made it interesting."
    },
    {
        "group": 1,
        "word": "loquacious",
        "definition": "tending to talk a great deal; talkative",
        "example": "The loquacious professor could lecture for hours on end without pausing."
    },
    {
        "group": 1,
        "word": "misanthropic",
        "definition": "disliking humankind and avoiding human society",
        "example": "His misanthropic tendencies made it hard for him to trust others."
    },
    {
        "group": 1,
        "word": "misnomer",
        "definition": "a wrong or inaccurate name or designation",
        "example": "Calling the park 'Central Park' is a misnomer since it's located uptown."
    },
    {
        "group": 1,
        "word": "negligent",
        "definition": "failing to take proper care in doing something",
        "example": "The company was found negligent in its handling of environmental regulations."
    },
    {
        "group": 1,
        "word": "obsequious",
        "definition": "obedient or attentive to an excessive or servile degree",
        "example": "The waiter's obsequious behavior towards the celebrity was embarrassing."
    },
    {
        "group": 1,
        "word": "placate",
        "definition": "make (someone) less angry or hostile",
        "example": "He tried to placate his boss by offering to work overtime to finish the project."
    },
    {
        "group": 1,
        "word": "proclivity",
        "definition": "a tendency to choose or do something regularly; an inclination or predisposition",
        "example": "Her proclivity for adventure led her to explore new countries every year."
    },
    {
        "group": 1,
        "word": "puerile",
        "definition": "childishly silly and trivial",
        "example": "His puerile jokes often amused his friends but annoyed his teachers."
    },
    {
        "group": 1,
        "word": "quixotic",
        "definition": "exceedingly idealistic; unrealistic and impractical",
        "example": "Her quixotic dream of ending world hunger inspired others but seemed unattainable."
    },
    {
        "group": 1,
        "word": "spendthrift",
        "definition": "a person who spends money in an extravagant, irresponsible way",
        "example": "His reputation as a spendthrift made him popular among his friends, but not with creditors."
    },
    {
        "group": 1,
        "word": "taciturn",
        "definition": "reserved or uncommunicative in speech; saying little",
        "example": "His taciturn nature often left others wondering what he was thinking."
    },
    {
        "group": 1,
        "word": "wary",
        "definition": "feeling or showing caution about possible dangers or problems",
        "example": "She was wary of strangers offering her deals that seemed too good to be true."
    },
    {
        "group": 2,
        "word": "adulterate",
        "definition": "render (something) poorer in quality by adding another substance",
        "example": "The chef was caught adulterating the expensive wine with water to increase profits."
    },
    {
        "group": 2,
        "word": "advocate",
        "definition": "publicly recommend or support",
        "example": "She is a strong advocate for animal rights and actively campaigns for their welfare."
    },
    {
        "group": 2,
        "word": "aggrandize",
        "definition": "increase the power, status, or wealth of",
        "example": "He often exaggerated his accomplishments to aggrandize his reputation in the industry."
    },
    {
        "group": 2,
        "word": "alacrity",
        "definition": "brisk and cheerful readiness",
        "example": "She accepted the challenge with alacrity, eager to prove herself."
    },
    {
        "group": 2,
        "word": "ambivalent",
        "definition": "having mixed feelings or contradictory ideas about something or someone",
        "example": "He felt ambivalent about the job offer, torn between its benefits and the location."
    },
    {
        "group": 2,
        "word": "ameliorate",
        "definition": "make (something bad or unsatisfactory) better",
        "example": "The new policies were implemented to ameliorate the working conditions for all employees."
    },
    {
        "group": 2,
        "word": "amenable",
        "definition": "open and responsive to suggestion; easily persuaded or controlled",
        "example": "She was amenable to compromise, willing to negotiate to find a solution."
    },
    {
        "group": 2,
        "word": "anachronistic",
        "definition": "belonging to a period other than that being portrayed",
        "example": "The use of typewriters in today's digital world seems anachronistic."
    },
    {
        "group": 2,
        "word": "audacious",
        "definition": "showing a willingness to take surprisingly bold risks",
        "example": "Her audacious plan to start her own business paid off handsomely."
    },
    {
        "group": 2,
        "word": "avaricious",
        "definition": "having or showing an extreme greed for wealth or material gain",
        "example": "His avaricious behavior eventually led to his downfall in the financial markets."
    },
    {
        "group": 2,
        "word": "banal",
        "definition": "so lacking in originality as to be obvious and boring",
        "example": "The movie's banal plot failed to capture the audience's interest."
    },
    {
        "group": 2,
        "word": "benign",
        "definition": "gentle and kind; not harmful",
        "example": "The tumor turned out to be benign, much to everyone's relief."
    },
    {
        "group": 2,
        "word": "brazen",
        "definition": "bold and without shame",
        "example": "She made a brazen attempt to cheat on the exam, right under the teacher's nose."
    },
    {
        "group": 2,
        "word": "calumny",
        "definition": "the making of false and defamatory statements about someone in order to damage their reputation",
        "example": "The politician's opponents resorted to calumny to tarnish his image before the election."
    },
    {
        "group": 2,
        "word": "candid",
        "definition": "truthful and straightforward; frank",
        "example": "She appreciated his candid feedback, even though it was critical."
    },
    {
        "group": 2,
        "word": "castigate",
        "definition": "reprimand (someone) severely",
        "example": "The coach castigated the team for their lackluster performance."
    },
    {
        "group": 2,
        "word": "caustic",
        "definition": "sarcastic in a scathing and bitter way",
        "example": "Her caustic remarks often left her colleagues feeling offended and hurt."
    },
    {
        "group": 2,
        "word": "construe",
        "definition": "interpret (a word or action) in a particular way",
        "example": "His silence was construed as a sign of agreement by the rest of the group."
    },
    {
        "group": 2,
        "word": "contrite",
        "definition": "feeling or expressing remorse or penitence; affected by guilt",
        "example": "She was truly contrite about her behavior and apologized sincerely."
    },
    {
        "group": 2,
        "word": "convoluted",
        "definition": "extremely complex and difficult to follow",
        "example": "The convoluted plot of the novel confused many readers."
    },
    {
        "group": 2,
        "word": "covet",
        "definition": "yearn to possess or have (something)",
        "example": "She secretly coveted her neighbor's luxurious car."
    },
    {
        "group": 2,
        "word": "craven",
        "definition": "contemptibly lacking in courage; cowardly",
        "example": "His craven behavior during the crisis disappointed everyone."
    },
    {
        "group": 2,
        "word": "decorum",
        "definition": "behavior in keeping with good taste and propriety",
        "example": "The guests were expected to maintain proper decorum during the formal dinner."
    },
    {
        "group": 2,
        "word": "deft",
        "definition": "neatly skillful and quick in one's movements or actions",
        "example": "The artist's deft brush strokes brought the portrait to life."
    },
    {
        "group": 2,
        "word": "demur",
        "definition": "raise doubts or objections or show reluctance",
        "example": "She demurred at the idea of relocating to another city for the job."
    },
    {
        "group": 2,
        "word": "derivative",
        "definition": "imitative of the work of another person, and usually disapproved of for that reason",
        "example": "His artwork was criticized for being derivative of famous painters."
    },
    {
        "group": 2,
        "word": "desiccate",
        "definition": "remove the moisture from (something, especially food), typically in order to preserve it",
        "example": "The hot climate would desiccate the fruits quickly if not stored properly."
    },
    {
        "group": 2,
        "word": "diatribe",
        "definition": "a forceful and bitter verbal attack against someone or something",
        "example": "His speech turned into a diatribe against the government's policies."
    },
    {
        "group": 2,
        "word": "incredulous",
        "definition": "doubtful and disbelieving",
        "example": "She gave him an incredulous look when he claimed to have seen a UFO."
    },
    {
        "group": 2,
        "word": "ingenuous",
        "definition": "naive and lacking experience",
        "example": "Her ingenuous approach to the problem impressed the seasoned researchers."
    },
    {
        "group": 3,
        "word": "abate",
        "definition": "become less intense or widespread"
    },
    {
        "group": 3,
        "word": "abjure",
        "definition": "solemnly renounce (a belief, cause, or claim)"
    },
    {
        "group": 3,
        "word": "anomalous",
        "definition": "deviating from what is standard, normal, or expected"
    },
    {
        "group": 3,
        "word": "antipathy",
        "definition": "a deep-seated feeling of dislike; aversion",
        "example": "His antipathy towards modern art was evident in his scathing critiques."
    },
    {
        "group": 3,
        "word": "arcane",
        "definition": "understood by few; mysterious or secret",
        "example": "The arcane rituals of the ancient cult were shrouded in mystery."
    },
    {
        "group": 3,
        "word": "arduous",
        "definition": "involving or requiring strenuous effort; difficult and tiring",
        "example": "The ascent up the mountain was arduous, but they persevered."
    },
    {
        "group": 3,
        "word": "artless",
        "definition": "without guile or deception; natural and simple",
        "example": "His artless charm won over even the most skeptical critics."
    },
    {
        "group": 3,
        "word": "ascetic",
        "definition": "characterized by severe self-discipline and abstention from all forms of indulgence",
        "example": "The ascetic monk lived a life of simplicity and spiritual devotion."
    },
    {
        "group": 3,
        "word": "assuage",
        "definition": "make (an unpleasant feeling) less intense",
        "example": "She tried to assuage his guilt by reassuring him that it wasn't his fault."
    },
    {
        "group": 3,
        "word": "betray",
        "definition": "expose (one's counta person) to danger by treacherously giving information to an enemy",
        "example": "He felt deeply hurt when his closest friend betrayed his trust."
    },
    {
        "group": 3,
        "word": "bucolic",
        "definition": "relating to the pleasant aspects of the countryside and country life",
        "example": "Their weekend retreat to the bucolic countryside was a welcome escape from city life."
    },
    {
        "group": 3,
        "word": "burgeon",
        "definition": "begin to grow or increase rapidly; flourish",
        "example": "After years of hard work, her business began to burgeon into a successful enterprise."
    },
    {
        "group": 3,
        "word": "cacophonous",
        "definition": "involving or producing a harsh, discordant mixture of sounds",
        "example": "The city streets were filled with the cacophonous noise of traffic and construction."
    },
    {
        "group": 3,
        "word": "canonize",
        "definition": "regard as being above reproach or of great significance",
        "example": "Her groundbreaking research was eventually canonized as a cornerstone of modern science."
    },
    {
        "group": 3,
        "word": "censure",
        "definition": "express severe disapproval of (someone or something), typically in a formal statement",
        "example": "The committee issued a censure against the senator for his unethical conduct."
    },
    {
        "group": 3,
        "word": "chicanery",
        "definition": "the use of trickery to achieve a political, financial, or legal purpose",
        "example": "The businessman's chicanery was exposed during the investigation into financial fraud."
    },
    {
        "group": 3,
        "word": "coalesce",
        "definition": "come together to form one mass or whole",
        "example": "The diverse communities began to coalesce around a shared vision for the future."
    },
    {
        "group": 3,
        "word": "cogent",
        "definition": "clear, logical, and convincing",
        "example": "Her cogent arguments persuaded even the most skeptical members of the jury."
    },
    {
        "group": 3,
        "word": "compelling",
        "definition": "evoking interest, attention, or admiration in a powerfully irresistible way",
        "example": "The author's compelling storytelling kept readers eagerly turning the pages."
    },
    {
        "group": 3,
        "word": "contend",
        "definition": "struggle to surmount (a difficulty or danger)",
        "example": "She had to contend with numerous obstacles on her path to success."
    },
    {
        "group": 3,
        "word": "copious",
        "definition": "abundant in supply or quantity",
        "example": "The scientist took copious notes during the experiment to ensure accuracy."
    },
    {
        "group": 3,
        "word": "cosmopolitan",
        "definition": "including or containing people from many different countries",
        "example": "New York City is known for its cosmopolitan atmosphere and cultural diversity."
    },
    {
        "group": 3,
        "word": "deference",
        "definition": "humble submission and respect",
        "example": "He showed great deference to his mentor, seeking advice and guidance."
    },
    {
        "group": 3,
        "word": "desultory",
        "definition": "lacking a plan, purpose, or enthusiasm",
        "example": "The desultory conversation wandered from topic to topic without any clear direction."
    },
    {
        "group": 3,
        "word": "diffident",
        "definition": "modest or shy because of a lack of self-confidence",
        "example": "Her diffident manner sometimes masked her intelligence and creativity."
    },
    {
        "group": 3,
        "word": "dilatory",
        "definition": "slow to act",
        "example": "His dilatory approach to decision-making often frustrated his colleagues."
    },
    {
        "group": 3,
        "word": "equivocate",
        "definition": "use ambiguous language so as to conceal the truth or avoid committing oneself",
        "example": "Politicians often equivocate when addressing controversial issues."
    },
    {
        "group": 3,
        "word": "polarize",
        "definition": "divide or cause to divide into two sharply contrasting groups or sets of opinions or beliefs",
        "example": "The issue of gun control tends to polarize public opinion."
    },
    {
        "group": 3,
        "word": "prodigal",
        "definition": "spending money or resources freely and recklessly; wastefully extravagant",
        "example": "His prodigal lifestyle eventually led to financial ruin."
    },
    {
        "group": 3,
        "word": "verbose",
        "definition": "using or expressed in more words than are needed",
        "example": "The verbose report could have been condensed into a few succinct paragraphs."
    },
    {
        "group": 4,
        "word": "abstain",
        "definition": "restrain oneself from doing or enjoying something",
        "example": "She chose to abstain from voting on the matter due to a conflict of interest."
    },
    {
        "group": 4,
        "word": "approbation",
        "definition": "approval or praise",
        "example": "The director's approbation of the actor's performance was evident in his glowing review."
    },
    {
        "group": 4,
        "word": "cherish",
        "definition": "protect and care for (someone) lovingly",
        "example": "She cherished her grandmother's old recipe book, which held memories of family gatherings."
    },
    {
        "group": 4,
        "word": "corroborate",
        "definition": "confirm or give support to (a statement, theory, or finding)",
        "example": "The witness's testimony corroborated the victim's account of the events."
    },
    {
        "group": 4,
        "word": "disparate",
        "definition": "essentially different in kind; not allowing comparison",
        "example": "Their music tastes were so disparate that they rarely agreed on what to listen to."
    },
    {
        "group": 4,
        "word": "emulate",
        "definition": "match or surpass (a person or achievement), typically by imitation",
        "example": "She tried to emulate her favorite artist's style in her own paintings."
    },
    {
        "group": 4,
        "word": "enervate",
        "definition": "cause (someone) to feel drained of energy or vitality; weaken",
        "example": "The intense heat enervated the hikers, making it difficult to continue the trek."
    },
    {
        "group": 4,
        "word": "ephemeral",
        "definition": "lasting for a very short time",
        "example": "The beauty of the sunset was ephemeral, fading quickly as darkness enveloped the sky."
    },
    {
        "group": 4,
        "word": "fervid",
        "definition": "intensely enthusiastic or passionate, especially to an excessive degree",
        "example": "His fervid speech rallied the crowd, inspiring them to take action for change."
    },
    {
        "group": 4,
        "word": "garrulous",
        "definition": "excessively talkative, especially on trivial matters",
        "example": "The garrulous old man at the bus stop would talk for hours about the weather."
    },
    {
        "group": 4,
        "word": "incendiary",
        "definition": "tending to stir up conflict; inflammatory",
        "example": "The politician's incendiary remarks sparked outrage among the opposing party."
    },
    {
        "group": 4,
        "word": "inimical",
        "definition": "tending to obstruct or harm",
        "example": "The new regulations were inimical to small businesses, causing many to struggle."
    },
    {
        "group": 4,
        "word": "intimate",
        "definition": "closely acquainted; familiar, close",
        "example": "They shared an intimate friendship that had lasted since childhood."
    },
    {
        "group": 4,
        "word": "invigorate",
        "definition": "give strength or energy to",
        "example": "A brisk walk in the cool morning air invigorated her, preparing her for the day ahead."
    },
    {
        "group": 4,
        "word": "mitigate",
        "definition": "make less severe, serious, or painful",
        "example": "Planting trees can help mitigate the effects of climate change by absorbing carbon dioxide."
    },
    {
        "group": 4,
        "word": "obsolete",
        "definition": "no longer produced or used; out of date",
        "example": "Typewriters have become obsolete with the advent of computers."
    },
    {
        "group": 4,
        "word": "opaque",
        "definition": "not able to be seen through; not transparent",
        "example": "The frosted glass was opaque, providing privacy without blocking all the light."
    },
    {
        "group": 4,
        "word": "paradigmatic",
        "definition": "of or denoting an example serving as a model or pattern",
        "example": "The Mona Lisa is considered a paradigmatic example of Renaissance art."
    },
    {
        "group": 4,
        "word": "pedantic",
        "definition": "excessively concerned with minor details or rules; overly scholarly",
        "example": "Her pedantic corrections on grammar distracted from the overall message of the essay."
    },
    {
        "group": 4,
        "word": "placid",
        "definition": "not easily upset or excited; calm and peaceful",
        "example": "The lake was placid, reflecting the peacefulness of the surrounding mountains."
    },
    {
        "group": 4,
        "word": "polemical",
        "definition": "relating to or involving strongly critical, controversial, or disputatious writing or speech",
        "example": "The author's polemical essay criticized the government's handling of the crisis."
    },
    {
        "group": 4,
        "word": "precipitate",
        "definition": "cause (an event or situation, typically one that is bad or undesirable) to happen suddenly, unexpectedly, or prematurely",
        "example": "The company's sudden closure precipitated chaos among its employees."
    },
    {
        "group": 4,
        "word": "profundity",
        "definition": "deep insight; great depth of knowledge or thought",
        "example": "His lectures were known for their profundity, challenging students to think deeply."
    },
    {
        "group": 4,
        "word": "prophetic",
        "definition": "accurately describing or predicting what will happen in the future",
        "example": "Her prophetic words about the economy proved true when the recession hit."
    },
    {
        "group": 4,
        "word": "prudent",
        "definition": "acting with or showing care and thought for the future",
        "example": "It's prudent to save money for emergencies rather than spend it all on luxuries."
    },
    {
        "group": 4,
        "word": "punctilious",
        "definition": "showing great attention to detail or correct behavior",
        "example": "He was punctilious about his appearance, always impeccably dressed."
    },
    {
        "group": 4,
        "word": "recondite",
        "definition": "little known; abstruse",
        "example": "The philosopher's recondite theories were difficult for even experts to understand."
    },
    {
        "group": 4,
        "word": "scrupulous",
        "definition": "diligent, thorough, and extremely attentive to details",
        "example": "She was scrupulous in following the ethical guidelines of her profession."
    },
    {
        "group": 4,
        "word": "tranquil",
        "definition": "free from disturbance; calm",
        "example": "The garden was a tranquil oasis in the middle of the bustling city."
    },
    {
        "group": 4,
        "word": "vacillate",
        "definition": "alternate or waver between different opinions or actions; be indecisive",
        "example": "He vacillated between accepting the job offer and staying at his current position."
    },
    {
        "group": 5,
        "word": "aloof",
        "definition": "not friendly or forthcoming; cool and distant"
    },
    {
        "group": 5,
        "word": "clangor",
        "definition": "a continuous loud banging or ringing sound"
    },
    {
        "group": 5,
        "word": "conventional",
        "definition": "based on or in accordance with what is generally done or believed"
    },
    {
        "group": 5,
        "word": "debunk",
        "definition": "expose the falseness or hollowness of (a myth, idea, or belief)"
    },
    {
        "group": 5,
        "word": "diminutive",
        "definition": "extremely or unusually small"
    },
    {
        "group": 5,
        "word": "discernible",
        "definition": "able to be discerned; perceptible"
    },
    {
        "group": 5,
        "word": "enigmatic",
        "definition": "difficult to interpret or understand; mysterious"
    },
    {
        "group": 5,
        "word": "estranged",
        "definition": "no longer close or affectionate to someone; alienated"
    },
    {
        "group": 5,
        "word": "extravagant",
        "definition": "lacking restraint in spending money or using resources"
    },
    {
        "group": 5,
        "word": "fanciful",
        "definition": "existing only in the imagination or fancy; not likely to become reality"
    },
    {
        "group": 5,
        "word": "frivolous",
        "definition": "not having any serious purpose or value"
    },
    {
        "group": 5,
        "word": "heterogeneous",
        "definition": "diverse in character or content"
    },
    {
        "group": 5,
        "word": "imperious",
        "definition": "assuming power or authority without justification; arrogant and domineering"
    },
    {
        "group": 5,
        "word": "impertinent",
        "definition": "not showing proper respect; rude"
    },
    {
        "group": 5,
        "word": "invasive",
        "definition": "tending to intrude on a person's thoughts or privacy"
    },
    {
        "group": 5,
        "word": "irresolute",
        "definition": "showing or feeling hesitancy; uncertain"
    },
    {
        "group": 5,
        "word": "laudable",
        "definition": "deserving praise and commendation"
    },
    {
        "group": 5,
        "word": "lax",
        "definition": "not sufficiently strict, severe, or careful"
    },
    {
        "group": 5,
        "word": "marginalize",
        "definition": "treat (a peconcept) as insignificant or peripheral"
    },
    {
        "group": 5,
        "word": "panache",
        "definition": "flamboyant confidence of style or manner"
    },
    {
        "group": 5,
        "word": "plodding",
        "definition": "slow-moving and unexciting"
    },
    {
        "group": 5,
        "word": "prosaic",
        "definition": "having the style or diction of prose; lacking poetic beauty"
    },
    {
        "group": 5,
        "word": "remedial",
        "definition": "giving or intended as a remedy or cure"
    },
    {
        "group": 5,
        "word": "restive",
        "definition": "unable to keep still or silent and becoming increasingly difficult to control, especially because of impatience, dissatisfaction, or boredom"
    },
    {
        "group": 5,
        "word": "sporadic",
        "definition": "occurring at irregular intervals or only in a few places; scattered or isolated"
    },
    {
        "group": 5,
        "word": "stigmatize",
        "definition": "describe or regard as worthy of disgrace or great disapproval"
    },
    {
        "group": 5,
        "word": "undermine",
        "definition": "erode the base or foundation of (a rock formation)"
    },
    {
        "group": 5,
        "word": "utterly",
        "definition": "completely and without qualification; absolutely"
    },
    {
        "group": 5,
        "word": "weary",
        "definition": "feeling or showing tiredness, especially as a result of excessive exertion or lack of sleep"
    },
    {
        "group": 5,
        "word": "zealous",
        "definition": "having or showing zeal; passionate; fervent"
    },
    {
        "group": 6,
        "word": "admonish",
        "definition": "warn or reprimand someone firmly"
    },
    {
        "group": 6,
        "word": "aesthetic",
        "definition": "concerned with beauty or the appreciation of beauty"
    },
    {
        "group": 6,
        "word": "affectation",
        "definition": "behavior, speech, or writing that is artificial and designed to impress"
    },
    {
        "group": 6,
        "word": "alleviate",
        "definition": "make (suffering, deficiency, or a problem) less severe"
    },
    {
        "group": 6,
        "word": "analogous",
        "definition": "comparable in certain respects, typically in a way that makes clearer the nature of the things compared"
    },
    {
        "group": 6,
        "word": "bolster",
        "definition": "support or strengthen"
    },
    {
        "group": 6,
        "word": "chauvinistic",
        "definition": "showing excessive patriotism or belief in national superiority"
    },
    {
        "group": 6,
        "word": "connoisseur",
        "definition": "an expert judge in matters of taste"
    },
    {
        "group": 6,
        "word": "dissemble",
        "definition": "conceal one's true motives, feelings, or beliefs"
    },
    {
        "group": 6,
        "word": "dogged",
        "definition": "having or showing tenacity and grim persistence"
    },
    {
        "group": 6,
        "word": "dupe",
        "definition": "deceive; trick"
    },
    {
        "group": 6,
        "word": "empirical",
        "definition": "based on, concerned with, or verifiable by observation or experience rather than theory or pure logic"
    },
    {
        "group": 6,
        "word": "engender",
        "definition": "cause or give rise to (a feeling, situation, or condition)"
    },
    {
        "group": 6,
        "word": "entitled",
        "definition": "believing oneself to be inherently deserving of privileges or special treatment"
    },
    {
        "group": 6,
        "word": "pertinacious",
        "definition": "holding firmly to an opinion or a course of action"
    },
    {
        "group": 6,
        "word": "presumptuous",
        "definition": "failing to observe the limits of what is permitted or appropriate"
    },
    {
        "group": 6,
        "word": "probity",
        "definition": "the quality of having strong moral principles; honesty and decency"
    },
    {
        "group": 6,
        "word": "proliferate",
        "definition": "increase rapidly in number; multiply"
    },
    {
        "group": 6,
        "word": "specious",
        "definition": "superficially plausible, but actually wrong"
    },
    {
        "group": 6,
        "word": "spurious",
        "definition": "not being what it purports to be; false or fake"
    },
    {
        "group": 6,
        "word": "subjective",
        "definition": "based on or influenced by personal feelings, tastes, or opinions"
    },
    {
        "group": 6,
        "word": "subvert",
        "definition": "undermine the power and authority of (an established system or institution)"
    },
    {
        "group": 6,
        "word": "timorous",
        "definition": "showing or suffering from nervousness, fear, or a lack of confidence"
    },
    {
        "group": 6,
        "word": "tortuous",
        "definition": "full of twists and turns; excessively lengthy and complex"
    },
    {
        "group": 6,
        "word": "tractable",
        "definition": "easy to control or influence"
    },
    {
        "group": 6,
        "word": "transient",
        "definition": "lasting only for a short time; impermanent"
    },
    {
        "group": 6,
        "word": "ubiquitous",
        "definition": "present, appearing, or found everywhere"
    },
    {
        "group": 6,
        "word": "underscore",
        "definition": "underline (something); emphasize or highlight"
    },
    {
        "group": 6,
        "word": "venal",
        "definition": "showing or motivated by susceptibility to bribery"
    },
    {
        "group": 6,
        "word": "venerate",
        "definition": "regard with great respect; revere"
    },
    {
        "group": 7,
        "word": "appease",
        "definition": "pacify or placate (someone) by acceding to their demands.",
        "example": "The government hoped to appease the protesters by promising reforms."
    },
    {
        "group": 7,
        "word": "arbitrary",
        "definition": "based on random choice or personal whim, rather than any reason or system.",
        "example": "The teacher's grading seemed arbitrary, with no clear criteria for marks."
    },
    {
        "group": 7,
        "word": "archaic",
        "definition": "very old or old-fashioned.",
        "example": "Some of the laws in the country are so archaic that they haven't been updated in centuries."
    },
    {
        "group": 7,
        "word": "clamorous",
        "definition": "making a loud and confused noise.",
        "example": "The clamorous crowd outside the stadium cheered loudly after the team's victory."
    },
    {
        "group": 7,
        "word": "dearth",
        "definition": "a scarcity or lack of something.",
        "example": "There was a dearth of qualified candidates for the job position."
    },
    {
        "group": 7,
        "word": "explicable",
        "definition": "able to be accounted for or understood.",
        "example": "The sudden change in weather patterns was not easily explicable."
    },
    {
        "group": 7,
        "word": "hyperbole",
        "definition": "exaggerated statements or claims not meant to be taken literally.",
        "example": "His stories were filled with hyperbole, making it hard to separate fact from fiction."
    },
    {
        "group": 7,
        "word": "immutable",
        "definition": "unchanging over time or unable to be changed.",
        "example": "The laws of physics are considered immutable under normal conditions."
    },
    {
        "group": 7,
        "word": "indefatigable",
        "definition": "persisting tirelessly.",
        "example": "She was an indefatigable advocate for human rights, working day and night."
    },
    {
        "group": 7,
        "word": "indolent",
        "definition": "wanting to avoid activity or exertion; lazy.",
        "example": "His indolent attitude towards work eventually cost him his job."
    },
    {
        "group": 7,
        "word": "insular",
        "definition": "narrow minded",
        "example": "Living in a small town, she had an insular view of the world."
    },
    {
        "group": 7,
        "word": "intransigent",
        "definition": "unwilling or refusing to change one's views or to agree about something.",
        "example": "The negotiations broke down because both sides were intransigent in their demands."
    },
    {
        "group": 7,
        "word": "intrepid",
        "definition": "fearless; adventurous.",
        "example": "The intrepid explorer ventured into the deep jungle, despite the dangers."
    },
    {
        "group": 7,
        "word": "irreverent",
        "definition": "showing a lack of respect for people or things that are generally taken seriously.",
        "example": "His irreverent jokes often offended those who were more traditional."
    },
    {
        "group": 7,
        "word": "loathe",
        "definition": "feel intense dislike or disgust for.",
        "example": "She couldn't hide the fact that she seemed to loathe her new job."
    },
    {
        "group": 7,
        "word": "malign",
        "definition": "speak about (someone) in a spitefully critical manner.",
        "example": "The tabloids continued to malign the actor's reputation, despite no evidence of wrongdoing."
    },
    {
        "group": 7,
        "word": "malleable",
        "definition": "easily influenced; pliable.",
        "example": "Young minds are often more malleable and receptive to new ideas."
    },
    {
        "group": 7,
        "word": "neophyte",
        "definition": "a person who is new to a subject, skill, or belief.",
        "example": "As a neophyte in the world of finance, he was eager to learn from experienced investors."
    },
    {
        "group": 7,
        "word": "plastic",
        "definition": "easily shaped or molded.",
        "example": "Clay is a plastic material that artists use to create sculptures."
    },
    {
        "group": 7,
        "word": "platitude",
        "definition": "a remark or statement, especially one with a moral content, that has been used too often to be interesting or thoughtful.",
        "example": "The politician's speech was filled with platitudes but lacked concrete plans for change."
    },
    {
        "group": 7,
        "word": "prescient",
        "definition": "having or showing knowledge of events before they take place.",
        "example": "Her prescient warnings about the economic downturn were ignored by many."
    },
    {
        "group": 7,
        "word": "pristine",
        "definition": "in its original condition; unspoiled.",
        "example": "The beach looked pristine in the early morning light, untouched by human footsteps."
    },
    {
        "group": 7,
        "word": "reproach",
        "definition": "address (someone) in such a way as to express disapproval or disappointment.",
        "example": "She looked at him with reproach after he forgot their anniversary."
    },
    {
        "group": 7,
        "word": "robust",
        "definition": "strong and healthy; vigorous.",
        "example": "Regular exercise and a balanced diet are essential for maintaining a robust immune system."
    },
    {
        "group": 7,
        "word": "salubrious",
        "definition": "health-giving; healthy.",
        "example": "The mountain air was considered salubrious, attracting health-conscious tourists."
    },
    {
        "group": 7,
        "word": "sanction",
        "definition": "a threatened penalty for disobeying a law or rule.",
        "example": "The government imposed sanctions on the country for violating international agreements."
    },
    {
        "group": 7,
        "word": "sedulous",
        "definition": "(of a person or action) showing dedication and diligence.",
        "example": "Her sedulous efforts in studying paid off when she aced the exam."
    },
    {
        "group": 7,
        "word": "soporific",
        "definition": "tending to induce drowsiness or sleep.",
        "example": "The professor's monotone voice had a soporific effect on the students during the lecture."
    },
    {
        "group": 7,
        "word": "stern",
        "definition": "(of a person or their manner) serious and unrelenting, especially in the assertion of authority and exercise of discipline.",
        "example": "His stern demeanor softened when he saw the child's tears."
    },
    {
        "group": 7,
        "word": "tendentious",
        "definition": "expressing or intending to promote a particular cause or point of view, especially a controversial one.",
        "example": "The article was criticized for its tendentious portrayal of the political situation."
    },
    {
        "group": 8,
        "word": "accentuate",
        "definition": "make more noticeable or prominent.",
        "example": "The designer used bold colors to accentuate the modern style of the room."
    },
    {
        "group": 8,
        "word": "conjectural",
        "definition": "based on or involving conjecture.",
        "example": "The scientist's theory was purely conjectural, lacking concrete evidence."
    },
    {
        "group": 8,
        "word": "convivial",
        "definition": "(of an atmosphere or event) friendly, lively, and enjoyable.",
        "example": "The party had a convivial atmosphere, with laughter and music filling the air."
    },
    {
        "group": 8,
        "word": "decadent",
        "definition": "characterized by or reflecting a state of moral or cultural decline.",
        "example": "The once-thriving empire had become decadent and corrupt."
    },
    {
        "group": 8,
        "word": "egregious",
        "definition": "outstandingly bad; shocking.",
        "example": "The student's egregious error cost the team the championship."
    },
    {
        "group": 8,
        "word": "evanescent",
        "definition": "soon passing out of sight, memory, or existence; quickly fading or disappearing.",
        "example": "The beauty of the sunset was evanescent, lasting only a few moments."
    },
    {
        "group": 8,
        "word": "flamboyant",
        "definition": "tending to attract attention because of their exuberance, confidence, and stylishness.",
        "example": "His flamboyant personality made him the center of attention at every party."
    },
    {
        "group": 8,
        "word": "forestall",
        "definition": "prevent or obstruct (an anticipated event or action) by taking action ahead of time.",
        "example": "The company took measures to forestall any potential legal issues."
    },
    {
        "group": 8,
        "word": "gainsay",
        "definition": "deny or contradict (a fact or statement).",
        "example": "It was impossible to gainsay the clear evidence presented in court."
    },
    {
        "group": 8,
        "word": "galvanize",
        "definition": "shock or excite (someone) into taking action.",
        "example": "The leader's passionate speech galvanized the crowd into action."
    },
    {
        "group": 8,
        "word": "indiscriminate",
        "definition": "done at random or without careful judgment.",
        "example": "The indiscriminate use of pesticides has harmed the environment."
    },
    {
        "group": 8,
        "word": "innocuous",
        "definition": "not harmful or offensive.",
        "example": "His comments were meant to be innocuous but were taken the wrong way."
    },
    {
        "group": 8,
        "word": "momentary",
        "definition": "lasting for a very short time; brief.",
        "example": "There was a momentary pause before the applause erupted."
    },
    {
        "group": 8,
        "word": "mundane",
        "definition": "lacking interest or excitement; dull.",
        "example": "She longed for adventure and escape from her mundane daily routine."
    },
    {
        "group": 8,
        "word": "nettlesome",
        "definition": "causing annoyance or difficulty.",
        "example": "The nettlesome delays in the construction project frustrated everyone involved."
    },
    {
        "group": 8,
        "word": "nullify",
        "definition": "make legally null and void; invalidate.",
        "example": "The court's decision will nullify the unfair contract."
    },
    {
        "group": 8,
        "word": "obviate",
        "definition": "remove (a need or difficulty).",
        "example": "The new medical treatment obviates the need for surgery."
    },
    {
        "group": 8,
        "word": "omnipresent",
        "definition": "widely or constantly encountered; common or widespread.",
        "example": "The influence of technology is omnipresent in modern life."
    },
    {
        "group": 8,
        "word": "oust",
        "definition": "drive out or expel (someone) from a position or place.",
        "example": "The rebels sought to oust the dictator from power."
    },
    {
        "group": 8,
        "word": "palpable",
        "definition": "(of a feeling or atmosphere) so intense as to seem almost tangible.",
        "example": "The tension in the room was palpable as the two rivals faced off."
    },
    {
        "group": 8,
        "word": "perfidy",
        "definition": "deceitfulness; untrustworthiness.",
        "example": "His perfidy in betraying his friends was unforgivable."
    },
    {
        "group": 8,
        "word": "profuse",
        "definition": "(especially of something offered or discharged) exuberantly plentiful; abundant.",
        "example": "She was profuse in her thanks for their assistance."
    },
    {
        "group": 8,
        "word": "pugnacious",
        "definition": "eager or quick to argue, quarrel, or fight.",
        "example": "His pugnacious attitude often got him into trouble."
    },
    {
        "group": 8,
        "word": "sagacious",
        "definition": "having or showing keen mental discernment and good judgment; shrewd.",
        "example": "The sagacious leader was able to navigate the country through difficult times."
    },
    {
        "group": 8,
        "word": "sanguine",
        "definition": "optimistic or positive, especially in an apparently bad or difficult situation.",
        "example": "Despite the challenges, she remained sanguine about the future."
    },
    {
        "group": 8,
        "word": "scant",
        "definition": "barely sufficient or adequate.",
        "example": "The recipe called for a scant cup of sugar, which wasn't enough to sweeten the cake."
    },
    {
        "group": 8,
        "word": "skullduggery",
        "definition": "underhanded or unscrupulous behavior; trickery.",
        "example": "The politician was known for his skullduggery and deceit."
    },
    {
        "group": 8,
        "word": "trivial",
        "definition": "of little value or importance.",
        "example": "They argued over the most trivial details of the plan."
    },
    {
        "group": 8,
        "word": "utilitarian",
        "definition": "designed to be useful or practical rather than attractive.",
        "example": "The building's utilitarian design prioritized function over form."
    },
    {
        "group": 8,
        "word": "vapid",
        "definition": "offering nothing that is stimulating or challenging; bland.",
        "example": "The conversation was vapid and uninteresting."
    },
    {
        "group": 9,
        "word": "boorish",
        "definition": "rough and bad-mannered; coarse.",
        "example": "His boorish behavior at the dinner table embarrassed everyone."
    },
    {
        "group": 9,
        "word": "brook",
        "definition": "tolerate or allow (something, typically dissent or opposition).",
        "example": "She would brook no criticism of her son's behavior."
    },
    {
        "group": 9,
        "word": "circumspect",
        "definition": "wary and unwilling to take risks.",
        "example": "He was circumspect in his financial dealings."
    },
    {
        "group": 9,
        "word": "comity",
        "definition": "courtesy and considerate behavior toward others.",
        "example": "The comity among the team members was evident in their respectful interactions."
    },
    {
        "group": 9,
        "word": "commensurate",
        "definition": "corresponding in size or degree; in proportion.",
        "example": "Her job responsibilities were commensurate with her salary."
    },
    {
        "group": 9,
        "word": "cordial",
        "definition": "warm and friendly.",
        "example": "They received a cordial welcome at the reception."
    },
    {
        "group": 9,
        "word": "deleterious",
        "definition": "causing harm or damage.",
        "example": "The chemical spill had deleterious effects on the local wildlife."
    },
    {
        "group": 9,
        "word": "dichotomy",
        "definition": "a division or contrast between two things that are or are represented as being opposed or entirely different.",
        "example": "The dichotomy between good and evil is a common theme in literature."
    },
    {
        "group": 9,
        "word": "edify",
        "definition": "instruct or improve (someone) morally or intellectually.",
        "example": "The teacher's goal was to edify her students, not just to teach them facts."
    },
    {
        "group": 9,
        "word": "elicit",
        "definition": "evoke or draw out (a response, answer, or fact) from someone in reaction to one's own actions or questions.",
        "example": "The comedian's jokes elicited laughter from the audience."
    },
    {
        "group": 9,
        "word": "erudite",
        "definition": "having or showing great knowledge or learning.",
        "example": "The professor's erudite lectures were appreciated by all his students."
    },
    {
        "group": 9,
        "word": "fecund",
        "definition": "producing or capable of producing an abundance of offspring or new growth; fertile.",
        "example": "The fecund soil of the region made it ideal for farming."
    },
    {
        "group": 9,
        "word": "feeble",
        "definition": "lacking physical strength, especially as a result of age or illness.",
        "example": "The old man was too feeble to climb the stairs."
    },
    {
        "group": 9,
        "word": "felicitous",
        "definition": "well chosen or suited to the circumstances.",
        "example": "Her felicitous choice of words impressed the audience."
    },
    {
        "group": 9,
        "word": "forbear",
        "definition": "politely or patiently restrain an impulse to do something; refrain.",
        "example": "He could not forbear making a joke in such a serious situation."
    },
    {
        "group": 9,
        "word": "haphazard",
        "definition": "lacking any obvious principle of organization.",
        "example": "The books were arranged in a haphazard manner on the shelf."
    },
    {
        "group": 9,
        "word": "hodgepodge",
        "definition": "a confused mixture.",
        "example": "The meeting was a hodgepodge of random topics."
    },
    {
        "group": 9,
        "word": "impede",
        "definition": "delay or prevent (someone or something) by obstructing them; hinder.",
        "example": "The heavy traffic impeded our progress."
    },
    {
        "group": 9,
        "word": "impetuous",
        "definition": "acting or done quickly and without thought or care.",
        "example": "His impetuous decision to quit his job left him without a plan."
    },
    {
        "group": 9,
        "word": "irascible",
        "definition": "having or showing a tendency to be easily angered.",
        "example": "His irascible nature made him difficult to work with."
    },
    {
        "group": 9,
        "word": "mercenary",
        "definition": "primarily concerned with making money at the expense of ethics.",
        "example": "The mercenary businessman cared little for the environment."
    },
    {
        "group": 9,
        "word": "meticulous",
        "definition": "showing great attention to detail; very careful and precise.",
        "example": "She was meticulous in her research, ensuring every detail was correct."
    },
    {
        "group": 9,
        "word": "mordant",
        "definition": "having or showing a sharp or critical quality; biting.",
        "example": "His mordant wit was both admired and feared by his colleagues."
    },
    {
        "group": 9,
        "word": "outstrip",
        "definition": "move faster than and overtake (someone else).",
        "example": "The new company managed to outstrip its competitors in just a few years."
    },
    {
        "group": 9,
        "word": "precarious",
        "definition": "not securely held or in position; dangerously likely to fall or collapse.",
        "example": "The precarious ladder looked like it might topple over at any moment."
    },
    {
        "group": 9,
        "word": "quirky",
        "definition": "characterized by peculiar or unexpected traits.",
        "example": "Her quirky sense of humor made her a hit at parties."
    },
    {
        "group": 9,
        "word": "repudiate",
        "definition": "refuse to accept or be associated with.",
        "example": "He chose to repudiate the allegations against him."
    },
    {
        "group": 9,
        "word": "tact",
        "definition": "adroitness and sensitivity in dealing with others or with difficult issues.",
        "example": "Diplomats must handle negotiations with tact and skill."
    },
    {
        "group": 9,
        "word": "trifling",
        "definition": "unimportant or trivial.",
        "example": "They argued over a trifling matter, wasting precious time."
    },
    {
        "group": 9,
        "word": "turbulent",
        "definition": "characterized by conflict, disorder, or confusion; not controlled or calm.",
        "example": "The country's turbulent history was marked by frequent uprisings."
    },
    {
        "group": 10,
        "word": "acumen",
        "definition": "the ability to make good judgments and quick decisions, typically in a particular domain.",
        "example": "Her business acumen led to the company's rapid growth."
    },
    {
        "group": 10,
        "word": "antithesis",
        "definition": "a person or thing that is the direct opposite of someone or something else.",
        "example": "His behavior is the antithesis of what is expected of a leader."
    },
    {
        "group": 10,
        "word": "ascribe",
        "definition": "attribute something to (a cause).",
        "example": "They ascribe his success to hard work and dedication."
    },
    {
        "group": 10,
        "word": "befuddled",
        "definition": "unable to think clearly; confused.",
        "example": "He was befuddled by the complex instructions."
    },
    {
        "group": 10,
        "word": "eschew",
        "definition": "deliberately avoid using; abstain from.",
        "example": "He decided to eschew all junk food from his diet."
    },
    {
        "group": 10,
        "word": "esoteric",
        "definition": "intended for or likely to be understood by only a small number of people with a specialized knowledge or interest.",
        "example": "The professor's lectures were so esoteric that only a few students understood them."
    },
    {
        "group": 10,
        "word": "evasive",
        "definition": "tending to avoid commitment or self-revelation, especially by responding only indirectly.",
        "example": "She gave an evasive answer when asked about her plans."
    },
    {
        "group": 10,
        "word": "exculpate",
        "definition": "show or declare that (someone) is not guilty of wrongdoing.",
        "example": "The evidence served to exculpate the accused."
    },
    {
        "group": 10,
        "word": "expedite",
        "definition": "make (an action or process) happen sooner or be accomplished more quickly.",
        "example": "We need to expedite the approval process."
    },
    {
        "group": 10,
        "word": "fastidious",
        "definition": "very attentive to and concerned about accuracy and detail.",
        "example": "She was fastidious about her appearance."
    },
    {
        "group": 10,
        "word": "feign",
        "definition": "pretend to be affected by (a feeling, state, or injury).",
        "example": "He would often feign illness to avoid going to school."
    },
    {
        "group": 10,
        "word": "furtive",
        "definition": "attempting to avoid notice or attention, typically because of guilt or a belief that discovery would lead to trouble; secretive.",
        "example": "They exchanged furtive glances across the room."
    },
    {
        "group": 10,
        "word": "hamper",
        "definition": "hinder or impede the movement or progress of.",
        "example": "The storm hampered rescue efforts."
    },
    {
        "group": 10,
        "word": "indispensable",
        "definition": "absolutely necessary.",
        "example": "A good dictionary is indispensable for learning a new language."
    },
    {
        "group": 10,
        "word": "lament",
        "definition": "a passionate expression of grief or sorrow.",
        "example": "Her lament for the lost opportunities was heartfelt."
    },
    {
        "group": 10,
        "word": "myopic",
        "definition": "nearsighted; lacking imagination, foresight, or intellectual insight.",
        "example": "His myopic viewpoint hindered his ability to see the bigger picture."
    },
    {
        "group": 10,
        "word": "nonchalant",
        "definition": "(of a person or manner) feeling or appearing casually calm and relaxed; not displaying anxiety, interest, or enthusiasm.",
        "example": "She gave a nonchalant shrug when asked about the test."
    },
    {
        "group": 10,
        "word": "partial",
        "definition": "favoring one side in a dispute above the other; biased.",
        "example": "The judge was criticized for being partial in his ruling."
    },
    {
        "group": 10,
        "word": "pensive",
        "definition": "engaged in, involving, or reflecting deep or serious thought.",
        "example": "He sat in a pensive mood, staring out the window."
    },
    {
        "group": 10,
        "word": "portend",
        "definition": "be a sign or warning that (something, especially something momentous or calamitous) is likely to happen.",
        "example": "The dark clouds portend a storm."
    },
    {
        "group": 10,
        "word": "provincial",
        "definition": "of or concerning a province of a country or empire.",
        "example": "She had a provincial attitude toward city life."
    },
    {
        "group": 10,
        "word": "rudimentary",
        "definition": "involving or limited to basic principles.",
        "example": "He had only a rudimentary knowledge of the language."
    },
    {
        "group": 10,
        "word": "salutary",
        "definition": "(especially with reference to something unwelcome or unpleasant) producing good effects; beneficial.",
        "example": "The accident was a salutary reminder of the dangers of driving too fast."
    },
    {
        "group": 10,
        "word": "sever",
        "definition": "divide by cutting or slicing, especially suddenly and forcibly.",
        "example": "He severed the rope with a knife."
    },
    {
        "group": 10,
        "word": "slight",
        "definition": "small in degree; inconsiderable.",
        "example": "There was a slight chance of rain."
    },
    {
        "group": 10,
        "word": "somnolent",
        "definition": "sleepy; drowsy.",
        "example": "The somnolent atmosphere of the library was perfect for studying."
    },
    {
        "group": 10,
        "word": "stoic",
        "definition": "a person who can endure pain or hardship without showing their feelings or complaining.",
        "example": "He remained stoic despite the pain."
    },
    {
        "group": 10,
        "word": "supersede",
        "definition": "take the place of (a person or thing previously in authority or use); supplant.",
        "example": "The new law will supersede the old one."
    },
    {
        "group": 10,
        "word": "tout",
        "definition": "attempt to sell (something), typically by pestering people in an aggressive or bold manner.",
        "example": "Street vendors were touting their wares."
    },
    {
        "group": 10,
        "word": "wane",
        "definition": "(of the moon) have a progressively smaller part of its visible surface illuminated, so that it appears to decrease in size.",
        "example": "As the moon waned, the nights grew darker."
    },
    {
        "group": 11,
        "word": "abhor",
        "definition": "regard with disgust and hatred.",
        "example": "She abhors any form of cruelty."
    },
    {
        "group": 11,
        "word": "boisterous",
        "definition": "noisy, energetic, and cheerful; rowdy.",
        "example": "The children were boisterous at the birthday party."
    },
    {
        "group": 11,
        "word": "chivalrous",
        "definition": "courteous and gallant, especially toward women.",
        "example": "He was chivalrous, always holding the door open for others."
    },
    {
        "group": 11,
        "word": "churlish",
        "definition": "rude in a mean-spirited and surly way.",
        "example": "His churlish remarks offended everyone at the table."
    },
    {
        "group": 11,
        "word": "clandestine",
        "definition": "kept secret or done secretively, especially because illicit.",
        "example": "They held a clandestine meeting to discuss the merger."
    },
    {
        "group": 11,
        "word": "complacent",
        "definition": "showing smug or uncritical satisfaction with oneself or one's achievements.",
        "example": "After winning the award, he became complacent and stopped trying as hard."
    },
    {
        "group": 11,
        "word": "cumbersome",
        "definition": "large or heavy and therefore difficult to carry or use; unwieldy.",
        "example": "The cumbersome package was difficult to transport."
    },
    {
        "group": 11,
        "word": "debilitating",
        "definition": "making someone very weak and infirm.",
        "example": "The disease had a debilitating effect on his health."
    },
    {
        "group": 11,
        "word": "deliberate",
        "definition": "done consciously and intentionally.",
        "example": "She made a deliberate attempt to befriend him."
    },
    {
        "group": 11,
        "word": "droll",
        "definition": "curious or unusual in a way that provokes dry amusement.",
        "example": "His droll sense of humor kept everyone entertained."
    },
    {
        "group": 11,
        "word": "eccentric",
        "definition": "unconventional and slightly strange.",
        "example": "Her eccentric fashion sense made her stand out."
    },
    {
        "group": 11,
        "word": "fractious",
        "definition": "irritable and quarrelsome.",
        "example": "The fractious child was difficult to manage."
    },
    {
        "group": 11,
        "word": "limpid",
        "definition": "clear and transparent; completely calm.",
        "example": "The limpid waters of the lake were inviting."
    },
    {
        "group": 11,
        "word": "mawkish",
        "definition": "sentimental in a feeble or sickly way.",
        "example": "The movie was criticized for its mawkish sentimentality."
    },
    {
        "group": 11,
        "word": "obeisance",
        "definition": "deferential respect.",
        "example": "They made obeisance to the queen."
    },
    {
        "group": 11,
        "word": "ostentatious",
        "definition": "characterized by vulgar or pretentious display; designed to impress or attract notice.",
        "example": "Her ostentatious jewelry drew everyone's attention."
    },
    {
        "group": 11,
        "word": "panacea",
        "definition": "a solution or remedy for all difficulties or diseases.",
        "example": "They hoped the new law would be a panacea for the economic issues."
    },
    {
        "group": 11,
        "word": "perfunctory",
        "definition": "carried out with a minimum of effort or reflection.",
        "example": "His perfunctory nod indicated he wasn't really paying attention."
    },
    {
        "group": 11,
        "word": "perilous",
        "definition": "full of danger or risk.",
        "example": "They embarked on a perilous journey through the mountains."
    },
    {
        "group": 11,
        "word": "pervasive",
        "definition": "spreading widely throughout an area or a group of people.",
        "example": "The influence of the Internet is pervasive in modern society."
    },
    {
        "group": 11,
        "word": "preclude",
        "definition": "prevent from happening; make impossible.",
        "example": "His injury precluded him from participating in the race."
    },
    {
        "group": 11,
        "word": "predilection",
        "definition": "a preference or special liking for something; a bias in favor of something.",
        "example": "She has a predilection for classical music."
    },
    {
        "group": 11,
        "word": "rapacious",
        "definition": "aggressively greedy or grasping.",
        "example": "The rapacious landlord raised the rent without notice."
    },
    {
        "group": 11,
        "word": "relish",
        "definition": "great enjoyment.",
        "example": "He ate the meal with great relish."
    },
    {
        "group": 11,
        "word": "satirical",
        "definition": "containing or using satire.",
        "example": "The satirical article mocked the politician's policies."
    },
    {
        "group": 11,
        "word": "sham",
        "definition": "a thing that is not what it is purported to be.",
        "example": "The promises were all a sham."
    },
    {
        "group": 11,
        "word": "skirt",
        "definition": "go around or past the edge of.",
        "example": "They skirted the issue during the meeting."
    },
    {
        "group": 11,
        "word": "sluggish",
        "definition": "slow-moving or inactive.",
        "example": "The sluggish economy was slow to recover."
    },
    {
        "group": 11,
        "word": "spartan",
        "definition": "showing indifference to comfort or luxury.",
        "example": "His spartan lifestyle was free from unnecessary luxuries."
    },
    {
        "group": 11,
        "word": "truculent",
        "definition": "eager or quick to argue or fight; aggressively defiant.",
        "example": "The truculent teenager was always getting into fights."
    },
    {
        "group": 12,
        "word": "acrimonious",
        "definition": "angry and bitter.",
        "example": "The debate became increasingly acrimonious as it went on."
    },
    {
        "group": 12,
        "word": "belligerent",
        "definition": "hostile and aggressive.",
        "example": "His belligerent attitude caused a lot of tension."
    },
    {
        "group": 12,
        "word": "beneficent",
        "definition": "generous or doing good.",
        "example": "The beneficent donor contributed a large sum to the charity."
    },
    {
        "group": 12,
        "word": "canny",
        "definition": "having or showing shrewdness and good judgment, especially in money or business matters.",
        "example": "Her canny investments made her a millionaire."
    },
    {
        "group": 12,
        "word": "cavalier",
        "definition": "showing a lack of proper concern; offhand.",
        "example": "His cavalier attitude toward safety worried his colleagues."
    },
    {
        "group": 12,
        "word": "distressed",
        "definition": "suffering from extreme anxiety, sorrow, or pain.",
        "example": "She was distressed by the news of her friend's accident."
    },
    {
        "group": 12,
        "word": "dwindling",
        "definition": "gradually diminishing in size, amount, or strength.",
        "example": "Their savings were dwindling quickly."
    },
    {
        "group": 12,
        "word": "eclipse",
        "definition": "a loss of significance or power in relation to another person or thing.",
        "example": "The rise of social media led to the eclipse of traditional news outlets."
    },
    {
        "group": 12,
        "word": "encyclopedic",
        "definition": "comprehensive in terms of information.",
        "example": "Her encyclopedic knowledge of history impressed everyone."
    },
    {
        "group": 12,
        "word": "exacerbate",
        "definition": "make (a problem, bad situation, or negative feeling) worse.",
        "example": "His harsh words only exacerbated the situation."
    },
    {
        "group": 12,
        "word": "exasperated",
        "definition": "irritated intensely; infuriated.",
        "example": "She was exasperated by his constant lateness."
    },
    {
        "group": 12,
        "word": "fungible",
        "definition": "(of goods contracted for without an individual specimen being specified) able to replace or be replaced by another identical item; mutually interchangeable.",
        "example": "The goods are fungible and can be easily traded."
    },
    {
        "group": 12,
        "word": "hackneyed",
        "definition": "lacking significance through having been overused; unoriginal and trite.",
        "example": "The movie's plot was hackneyed and predictable."
    },
    {
        "group": 12,
        "word": "incongruous",
        "definition": "not in harmony or keeping with the surroundings or other aspects of something.",
        "example": "His outburst was incongruous with the quiet atmosphere of the meeting."
    },
    {
        "group": 12,
        "word": "interchangeable",
        "definition": "able to be exchanged with each other.",
        "example": "The parts are fully interchangeable."
    },
    {
        "group": 12,
        "word": "laconic",
        "definition": "using very few words.",
        "example": "His laconic reply suggested he was not interested in the conversation."
    },
    {
        "group": 12,
        "word": "lucrative",
        "definition": "producing a great deal of profit.",
        "example": "She found a lucrative job in the tech industry."
    },
    {
        "group": 12,
        "word": "magisterial",
        "definition": "having or showing great authority.",
        "example": "The judge's magisterial presence commanded respect."
    },
    {
        "group": 12,
        "word": "onerous",
        "definition": "involving a great deal of effort, trouble, or difficulty.",
        "example": "The job was more onerous than he had expected."
    },
    {
        "group": 12,
        "word": "opprobrium",
        "definition": "harsh criticism or censure.",
        "example": "He faced opprobrium from his colleagues for his controversial views."
    },
    {
        "group": 12,
        "word": "parsimonious",
        "definition": "unwilling to spend money or use resources; stingy or frugal.",
        "example": "Her parsimonious nature made her unpopular with her colleagues."
    },
    {
        "group": 12,
        "word": "peripheral",
        "definition": "relating to or situated on the edge or periphery of something.",
        "example": "They focused on the peripheral details and missed the main issue."
    },
    {
        "group": 12,
        "word": "provocative",
        "definition": "causing annoyance, anger, or another strong reaction, especially deliberately.",
        "example": "His provocative comments sparked a heated debate."
    },
    {
        "group": 12,
        "word": "renounce",
        "definition": "formally declare one's abandonment of (a claim, right, or possession).",
        "example": "He renounced his claim to the throne."
    },
    {
        "group": 12,
        "word": "tempestuous",
        "definition": "characterized by strong and turbulent or conflicting emotion.",
        "example": "Their tempestuous relationship was always in the news."
    },
    {
        "group": 12,
        "word": "tenable",
        "definition": "able to be maintained or defended against attack or objection.",
        "example": "Her position was no longer tenable after the scandal."
    },
    {
        "group": 12,
        "word": "transgression",
        "definition": "an act that goes against a law, rule, or code of conduct; an offense.",
        "example": "He was punished for his transgressions."
    },
    {
        "group": 12,
        "word": "urbane",
        "definition": "suave, courteous, and refined in manner.",
        "example": "His urbane manner made him popular at social gatherings."
    },
    {
        "group": 12,
        "word": "verisimilitude",
        "definition": "the appearance of being true or real.",
        "example": "The film's verisimilitude made it a hit with audiences."
    },
    {
        "group": 12,
        "word": "vitiate",
        "definition": "spoil or impair the quality or efficiency of.",
        "example": "The impact of the report was vitiated by its many inaccuracies."
    },
    {
        "group": 13,
        "word": "affinity",
        "definition": "a spontaneous or natural liking or sympathy for someone or something.",
        "example": "She had a natural affinity for animals and often volunteered at the local shelter."
    },
    {
        "group": 13,
        "word": "altruistic",
        "definition": "showing a disinterested and selfless concern for the well-being of others; unselfish.",
        "example": "His altruistic actions, like donating to charity, were admired by all."
    },
    {
        "group": 13,
        "word": "baroque",
        "definition": "relating to or denoting a style of European architecture, music, and art of the 137th and 138th centuries that followed mannerism and is characterized by ornate detail.",
        "example": "The baroque architecture of the cathedral amazed all the visitors."
    },
    {
        "group": 13,
        "word": "byzantine",
        "definition": "excessively complicated, typically involving a great deal of administrative detail; labyrinthine.",
        "example": "The company's byzantine bureaucracy made it difficult to get anything done quickly."
    },
    {
        "group": 13,
        "word": "compromise",
        "definition": "an agreement or settlement of a dispute that is reached by each side making concessions.",
        "example": "After hours of negotiation, they finally reached a compromise."
    },
    {
        "group": 13,
        "word": "conciliatory",
        "definition": "intended or likely to placate or pacify.",
        "example": "Her conciliatory approach helped ease tensions during the meeting."
    },
    {
        "group": 13,
        "word": "countenance",
        "definition": "a person's face or facial expression.",
        "example": "His solemn countenance indicated that the news was serious."
    },
    {
        "group": 13,
        "word": "covert",
        "definition": "not openly acknowledged or displayed.",
        "example": "They planned a covert operation to gather intelligence."
    },
    {
        "group": 13,
        "word": "credible",
        "definition": "able to be believed; convincing.",
        "example": "The witness provided a credible account of the incident."
    },
    {
        "group": 13,
        "word": "diffuse",
        "definition": "spread out over a large area; not concentrated.",
        "example": "The light from the lamp was soft and diffuse, filling the room with a gentle glow."
    },
    {
        "group": 13,
        "word": "documentary",
        "definition": "consisting of or based on official documents.",
        "example": "They presented a documentary account of the historical events."
    },
    {
        "group": 13,
        "word": "exhaustive",
        "definition": "examining, including, or considering all elements or aspects; fully comprehensive.",
        "example": "The study was exhaustive, covering all possible aspects of the issue."
    },
    {
        "group": 13,
        "word": "exhilarating",
        "definition": "making one feel very happy, animated, or elated; thrilling.",
        "example": "Skydiving was the most exhilarating experience of her life."
    },
    {
        "group": 13,
        "word": "extraneous",
        "definition": "irrelevant or unrelated to the subject being dealt with.",
        "example": "Remove any extraneous information from your report."
    },
    {
        "group": 13,
        "word": "fervor",
        "definition": "intense and passionate feeling.",
        "example": "His fervor for the cause was evident in his speeches."
    },
    {
        "group": 13,
        "word": "futile",
        "definition": "incapable of producing any useful result; pointless.",
        "example": "All their efforts to save the business were ultimately futile."
    },
    {
        "group": 13,
        "word": "illusory",
        "definition": "based on illusion; not real.",
        "example": "His sense of security was illusory and didn't last long."
    },
    {
        "group": 13,
        "word": "invidious",
        "definition": "likely to arouse resentment or anger in others.",
        "example": "The manager's invidious comments created a hostile work environment."
    },
    {
        "group": 13,
        "word": "lethargic",
        "definition": "affected by lethargy; sluggish and apathetic.",
        "example": "After the long flight, she felt lethargic and unmotivated."
    },
    {
        "group": 13,
        "word": "metaphorical",
        "definition": "metaphorically representing something as another thing; symbolic.",
        "example": "His metaphorical language added depth to the poem."
    },
    {
        "group": 13,
        "word": "mimic",
        "definition": "imitate (someone or their actions or words), typically in order to entertain or ridicule.",
        "example": "The comedian could mimic the president's speech perfectly."
    },
    {
        "group": 13,
        "word": "numinous",
        "definition": "having a strong religious or spiritual quality; indicating or suggesting the presence of a divinity.",
        "example": "The numinous atmosphere of the ancient temple left a lasting impression on the visitors."
    },
    {
        "group": 13,
        "word": "obscure",
        "definition": "not discovered or known about; uncertain.",
        "example": "The origins of the artifact remain obscure to this day."
    },
    {
        "group": 13,
        "word": "overt",
        "definition": "done or shown openly; plainly or readily apparent, not secret or hidden.",
        "example": "His overt display of affection surprised everyone."
    },
    {
        "group": 13,
        "word": "pellucid",
        "definition": "transparently clear; easily understandable.",
        "example": "The water in the mountain stream was pellucid."
    },
    {
        "group": 13,
        "word": "perpetuate",
        "definition": "make (something, typically an undesirable situation or an unfounded belief) continue indefinitely.",
        "example": "The media often perpetuates stereotypes."
    },
    {
        "group": 13,
        "word": "rational",
        "definition": "based on or in accordance with reason or logic.",
        "example": "Her decision was completely rational, considering all the evidence."
    },
    {
        "group": 13,
        "word": "scathing",
        "definition": "severely critical.",
        "example": "The critic's review was scathing and harsh."
    },
    {
        "group": 13,
        "word": "subtle",
        "definition": "delicate or precise as to be difficult to analyze or describe.",
        "example": "The artist's use of color was subtle but effective."
    },
    {
        "group": 13,
        "word": "superficial",
        "definition": "existing or occurring at or on the surface.",
        "example": "Their relationship was superficial and lacked depth."
    },
    {
        "group": 14,
        "word": "acquiesce",
        "definition": "accept something reluctantly but without protest.",
        "example": "Despite his reservations, he decided to acquiesce to their demands."
    },
    {
        "group": 14,
        "word": "adroit",
        "definition": "clever or skillful in using the hands or mind.",
        "example": "She was adroit at solving complex puzzles."
    },
    {
        "group": 14,
        "word": "amend",
        "definition": "make minor changes in (a text) in order to make it fairer, more accurate, or more up-to-date.",
        "example": "They agreed to amend the contract to include new terms."
    },
    {
        "group": 14,
        "word": "animus",
        "definition": "hostility or ill feeling.",
        "example": "His animus towards his rival was well-known."
    },
    {
        "group": 14,
        "word": "apologist",
        "definition": "a person who offers an argument in defense of something controversial.",
        "example": "He was an apologist for the regime, often defending its policies."
    },
    {
        "group": 14,
        "word": "astringent",
        "definition": "sharply critical or severe in manner or style.",
        "example": "Her astringent remarks left him feeling embarrassed."
    },
    {
        "group": 14,
        "word": "collaborate",
        "definition": "work jointly on an activity, especially to produce or create something.",
        "example": "They decided to collaborate on a new project."
    },
    {
        "group": 14,
        "word": "competent",
        "definition": "having the necessary ability, knowledge, or skill to do something successfully.",
        "example": "He was a competent leader, respected by all."
    },
    {
        "group": 14,
        "word": "correlate",
        "definition": "have a mutual relationship or connection, in which one thing affects or depends on another.",
        "example": "Researchers found that the two variables correlate strongly."
    },
    {
        "group": 14,
        "word": "deride",
        "definition": "express contempt for; ridicule.",
        "example": "The critics derided the movie for its lack of originality."
    },
    {
        "group": 14,
        "word": "dictate",
        "definition": "lay down authoritatively; prescribe.",
        "example": "The policy dictated how the funds should be allocated."
    },
    {
        "group": 14,
        "word": "discreet",
        "definition": "careful and circumspect in one's speech or actions, especially in order to avoid causing offense or to gain an advantage.",
        "example": "She was discreet in handling the sensitive information."
    },
    {
        "group": 14,
        "word": "divorced",
        "definition": "separate or dissociate (something) from something else, typically with an undesirable effect.",
        "example": "His work life was completely divorced from his personal life."
    },
    {
        "group": 14,
        "word": "elitist",
        "definition": "favoring, advocating, or restricted to an elite, privileged group.",
        "example": "The school's elitist policies favored wealthy students."
    },
    {
        "group": 14,
        "word": "exacting",
        "definition": "making great demands on one's skill, attention, or other resources.",
        "example": "The exacting standards of the job required meticulous attention to detail."
    },
    {
        "group": 14,
        "word": "flummoxed",
        "definition": "bewildered or perplexed.",
        "example": "The complex instructions left everyone flummoxed."
    },
    {
        "group": 14,
        "word": "fruitful",
        "definition": "producing good or helpful results; productive.",
        "example": "Their discussion was fruitful, leading to several new ideas."
    },
    {
        "group": 14,
        "word": "inborn",
        "definition": "existing from birth; congenital.",
        "example": "Her inborn talent for music was evident from a young age."
    },
    {
        "group": 14,
        "word": "polymath",
        "definition": "a person of wide-ranging knowledge or learning.",
        "example": "Leonardo da Vinci was a true polymath, excelling in multiple fields."
    },
    {
        "group": 14,
        "word": "reticent",
        "definition": "not revealing one's thoughts or feelings readily.",
        "example": "She was reticent about her plans for the future."
    },
    {
        "group": 14,
        "word": "stringent",
        "definition": "strict, precise, and exacting.",
        "example": "The stringent guidelines ensured that the project met all safety standards."
    },
    {
        "group": 14,
        "word": "subservient",
        "definition": "prepared to obey others unquestioningly.",
        "example": "He was subservient to his boss, always following orders without question."
    },
    {
        "group": 14,
        "word": "surreptitious",
        "definition": "kept secret, especially because it would not be approved of.",
        "example": "Their surreptitious meetings were held in a secluded location."
    },
    {
        "group": 14,
        "word": "tantalizing",
        "definition": "tormenting or teasing with the sight or promise of something that is unobtainable.",
        "example": "The tantalizing aroma of fresh bread made him hungry."
    },
    {
        "group": 14,
        "word": "tantamount",
        "definition": "equivalent in seriousness to; virtually the same as.",
        "example": "His resignation was tantamount to an admission of guilt."
    },
    {
        "group": 14,
        "word": "torpor",
        "definition": "a state of physical or mental inactivity; lethargy.",
        "example": "The heat induced a state of torpor in everyone."
    },
    {
        "group": 14,
        "word": "trenchant",
        "definition": "vigorous or incisive in expression or style.",
        "example": "Her trenchant analysis of the situation impressed everyone."
    },
    {
        "group": 14,
        "word": "umbrage",
        "definition": "offense or annoyance.",
        "example": "He took umbrage at the slightest criticism."
    },
    {
        "group": 14,
        "word": "versatile",
        "definition": "able to adapt or be adapted to many different functions or activities.",
        "example": "The versatile actor could play a wide range of roles."
    },
    {
        "group": 14,
        "word": "wayward",
        "definition": "difficult to control or predict because of unusual or perverse behavior.",
        "example": "His wayward behavior often got him into trouble."
    },
    {
        "group": 15,
        "word": "alienate",
        "definition": "cause (someone) to feel isolated or estranged.",
        "example": "His rude behavior alienated his colleagues."
    },
    {
        "group": 15,
        "word": "apathy",
        "definition": "lack of interest, enthusiasm, or concern.",
        "example": "The student's apathy towards the class was evident in his low grades."
    },
    {
        "group": 15,
        "word": "apropos",
        "definition": "with reference to; concerning.",
        "example": "His comments were apropos of the current debate."
    },
    {
        "group": 15,
        "word": "apt",
        "definition": "appropriate or suitable in the circumstances.",
        "example": "The movie was apt for the occasion."
    },
    {
        "group": 15,
        "word": "cloak",
        "definition": "hide, cover, or disguise (something).",
        "example": "She tried to cloak her nervousness with a smile."
    },
    {
        "group": 15,
        "word": "consensus",
        "definition": "general agreement among a group of people.",
        "example": "The committee reached a consensus on the new policy."
    },
    {
        "group": 15,
        "word": "distort",
        "definition": "pull or twist out of shape.",
        "example": "The funhouse mirrors distorted their reflections."
    },
    {
        "group": 15,
        "word": "divergent",
        "definition": "tending to be different or develop in different directions.",
        "example": "Their opinions were too divergent to find common ground."
    },
    {
        "group": 15,
        "word": "elated",
        "definition": "make (someone) ecstatically happy.",
        "example": "She was elated by the news of her promotion."
    },
    {
        "group": 15,
        "word": "enchant",
        "definition": "delight (someone) greatly.",
        "example": "The children were enchanted by the magician's performance."
    },
    {
        "group": 15,
        "word": "entrenched",
        "definition": "established firmly and securely.",
        "example": "The traditions were deeply entrenched in the community."
    },
    {
        "group": 15,
        "word": "exotic",
        "definition": "originating in or characteristic of a distant foreign country.",
        "example": "They enjoyed the exotic flavors of the dish."
    },
    {
        "group": 15,
        "word": "exploitative",
        "definition": "making use of a situation or treating others unfairly in order to gain an advantage or benefit.",
        "example": "The company's exploitative practices were criticized by the media."
    },
    {
        "group": 15,
        "word": "foreseeable",
        "definition": "able to be foreseen or predicted.",
        "example": "They tried to plan for every foreseeable event."
    },
    {
        "group": 15,
        "word": "forsake",
        "definition": "abandon or leave.",
        "example": "He decided to forsake his hometown for a new life in the city."
    },
    {
        "group": 15,
        "word": "gratify",
        "definition": "give (someone) pleasure or satisfaction.",
        "example": "It gratified him to see his work appreciated."
    },
    {
        "group": 15,
        "word": "heed",
        "definition": "pay attention to; take notice of.",
        "example": "She failed to heed the warning signs."
    },
    {
        "group": 15,
        "word": "judicious",
        "definition": "having, showing, or done with good judgment or sense.",
        "example": "They made a judicious decision based on the available information."
    },
    {
        "group": 15,
        "word": "lucid",
        "definition": "expressed clearly; easy to understand.",
        "example": "His explanation was lucid and to the point."
    },
    {
        "group": 15,
        "word": "pertinent",
        "definition": "relevant or applicable to a particular matter.",
        "example": "Her questions were pertinent to the discussion."
    },
    {
        "group": 15,
        "word": "propriety",
        "definition": "the state or quality of conforming to conventionally accepted standards of behavior or morals.",
        "example": "They questioned the propriety of his actions."
    },
    {
        "group": 15,
        "word": "scintillating",
        "definition": "sparkling or shining brightly.",
        "example": "Her scintillating conversation captivated the guests."
    },
    {
        "group": 15,
        "word": "sensational",
        "definition": "causing great public interest and excitement.",
        "example": "The news report was sensational but lacked substance."
    },
    {
        "group": 15,
        "word": "sophisticated",
        "definition": "having, revealing, or involving a great deal of worldly experience and knowledge of fashion and culture.",
        "example": "She had a sophisticated sense of style."
    },
    {
        "group": 15,
        "word": "strife",
        "definition": "angry or bitter disagreement over fundamental issues; conflict.",
        "example": "The country was torn apart by internal strife."
    },
    {
        "group": 15,
        "word": "understated",
        "definition": "presented or expressed in a subtle and effective way.",
        "example": "Her understated elegance made her stand out."
    },
    {
        "group": 15,
        "word": "unscrupulous",
        "definition": "having or showing no moral principles; not honest or fair.",
        "example": "The unscrupulous salesman lied about the car's condition."
    },
    {
        "group": 15,
        "word": "veracity",
        "definition": "conformity to facts; accuracy.",
        "example": "They questioned the veracity of his statement."
    },
    {
        "group": 15,
        "word": "virulent",
        "definition": "extremely severe or harmful in its effects.",
        "example": "The virulent virus spread rapidly through the population."
    },
    {
        "group": 15,
        "word": "volatile",
        "definition": "liable to change rapidly and unpredictably, especially for the worse.",
        "example": "The stock market is notoriously volatile."
    },
    {
        "group": 16,
        "word": "antedate",
        "definition": "precede in time; come before (something) in date."
    },
    {
        "group": 16,
        "word": "banish",
        "definition": "send (someone) away from a country or place as an official punishment."
    },
    {
        "group": 16,
        "word": "bridle",
        "definition": "show one's resentment or anger, especially by throwing up one's head and drawing in one's chin."
    },
    {
        "group": 16,
        "word": "comply",
        "definition": "act in accordance with a wish or command."
    },
    {
        "group": 16,
        "word": "crestfallen",
        "definition": "sad and disappointed."
    },
    {
        "group": 16,
        "word": "curtail",
        "definition": "reduce in extent or quantity; impose a restriction on."
    },
    {
        "group": 16,
        "word": "elucidate",
        "definition": "make (something) clear; explain."
    },
    {
        "group": 16,
        "word": "evade",
        "definition": "escape or avoid, especially by cleverness or trickery."
    },
    {
        "group": 16,
        "word": "feckless",
        "definition": "lacking initiative or strength of character; irresponsible."
    },
    {
        "group": 16,
        "word": "fester",
        "definition": "become worse or more intense, especially through long-term neglect or indifference."
    },
    {
        "group": 16,
        "word": "iconoclastic",
        "definition": "attacking or ignoring cherished beliefs and long-held traditions, etc., as being based on error, superstition, or lack of creativity."
    },
    {
        "group": 16,
        "word": "immure",
        "definition": "enclose or confine (someone) against their will."
    },
    {
        "group": 16,
        "word": "improvise",
        "definition": "create and perform (music, drama, or verse) spontaneously or without preparation."
    },
    {
        "group": 16,
        "word": "inhibit",
        "definition": "hinder, restrain, or prevent (an action or process)."
    },
    {
        "group": 16,
        "word": "inscrutable",
        "definition": "impossible to understand or interpret."
    },
    {
        "group": 16,
        "word": "lionize",
        "definition": "give a lot of public attention and approval to (someone); treat as a celebrity."
    },
    {
        "group": 16,
        "word": "monotonous",
        "definition": "dull, tedious, and repetitious; lacking in variety and interest."
    },
    {
        "group": 16,
        "word": "peculiar",
        "definition": "strange or odd; unusual."
    },
    {
        "group": 16,
        "word": "premeditate",
        "definition": "think out or plan (an action, especially a crime) beforehand."
    },
    {
        "group": 16,
        "word": "profligate",
        "definition": "recklessly extravagant or wasteful in the use of resources."
    },
    {
        "group": 16,
        "word": "reconcile",
        "definition": "restore friendly relations between."
    },
    {
        "group": 16,
        "word": "refine",
        "definition": "remove impurities or unwanted elements from (a substance), typically as part of an industrial process."
    },
    {
        "group": 16,
        "word": "relinquish",
        "definition": "voluntarily cease to keep or claim; give up."
    },
    {
        "group": 16,
        "word": "ruminate",
        "definition": "think deeply about something."
    },
    {
        "group": 16,
        "word": "skittish",
        "definition": "nervous or excitable; easily scared."
    },
    {
        "group": 16,
        "word": "superfluous",
        "definition": "unnecessary, especially through being more than enough."
    },
    {
        "group": 16,
        "word": "synoptic",
        "definition": "relating to a synopsis or summary."
    },
    {
        "group": 16,
        "word": "thorough",
        "definition": "complete with regard to every detail; not superficial or partial."
    },
    {
        "group": 16,
        "word": "visionary",
        "definition": "thinking about or planning the future with imagination or wisdom."
    },
    {
        "group": 16,
        "word": "vociferous",
        "definition": "vehement or clamorous."
    },
    {
        "group": 17,
        "word": "acclaim",
        "definition": "praise enthusiastically and publicly."
    },
    {
        "group": 17,
        "word": "ascertain",
        "definition": "find (something) out for certain; make sure of."
    },
    {
        "group": 17,
        "word": "assertive",
        "definition": "having or showing a confident and forceful personality."
    },
    {
        "group": 17,
        "word": "bogus",
        "definition": "not genuine or true; fake."
    },
    {
        "group": 17,
        "word": "cataclysmic",
        "definition": "involving or causing sudden great damage or suffering."
    },
    {
        "group": 17,
        "word": "circumscribe",
        "definition": "restrict (something) within limits."
    },
    {
        "group": 17,
        "word": "complementary",
        "definition": "combining in such a way as to enhance or emphasize the qualities of each other or another."
    },
    {
        "group": 17,
        "word": "contentious",
        "definition": "causing or likely to cause an argument; controversial."
    },
    {
        "group": 17,
        "word": "disingenuous",
        "definition": "not candid or sincere, typically by pretending that one knows less about something than one really does."
    },
    {
        "group": 17,
        "word": "divulge",
        "definition": "make known (private or sensitive information)."
    },
    {
        "group": 17,
        "word": "dogmatic",
        "definition": "inclined to lay down principles as incontrovertibly true."
    },
    {
        "group": 17,
        "word": "fallacious",
        "definition": "based on a mistaken belief."
    },
    {
        "group": 17,
        "word": "foolhardy",
        "definition": "recklessly bold or rash."
    },
    {
        "group": 17,
        "word": "hinder",
        "definition": "create difficulties for (someone or something), resulting in delay or obstruction."
    },
    {
        "group": 17,
        "word": "impair",
        "definition": "weaken or damage (something, especially a faculty or function)."
    },
    {
        "group": 17,
        "word": "impugn",
        "definition": "dispute the truth, validity, or honesty of (a statement or motive); call into question."
    },
    {
        "group": 17,
        "word": "incessant",
        "definition": "continuing without pause or interruption."
    },
    {
        "group": 17,
        "word": "inclined",
        "definition": "feeling willing or favorably disposed toward (an action, belief, or attitude)."
    },
    {
        "group": 17,
        "word": "inveterate",
        "definition": "having a particular habit, activity, or interest that is long-established and unlikely to change."
    },
    {
        "group": 17,
        "word": "miserly",
        "definition": "of or characteristic of a miser; stingy."
    },
    {
        "group": 17,
        "word": "patent",
        "definition": "easily recognizable; obvious."
    },
    {
        "group": 17,
        "word": "petulant",
        "definition": "childishly sulky or bad-tempered."
    },
    {
        "group": 17,
        "word": "pithy",
        "definition": "concise and forcefully expressive."
    },
    {
        "group": 17,
        "word": "pliant",
        "definition": "easily bent; flexible."
    },
    {
        "group": 17,
        "word": "sanctimonious",
        "definition": "making a show of being morally superior to other people."
    },
    {
        "group": 17,
        "word": "sound",
        "definition": "based on reason, sense, or judgment."
    },
    {
        "group": 17,
        "word": "tarnish",
        "definition": "lose or cause to lose luster, especially as a result of exposure to air or moisture."
    },
    {
        "group": 17,
        "word": "tepid",
        "definition": "showing little enthusiasm."
    },
    {
        "group": 17,
        "word": "upbraid",
        "definition": "find fault with (someone); scold."
    },
    {
        "group": 17,
        "word": "vexation",
        "definition": "the state of being annoyed, frustrated, or worried."
    },
    {
        "group": 18,
        "word": "abet",
        "definition": "encourage or assist (someone) to do something wrong, in particular, to commit a crime."
    },
    {
        "group": 18,
        "word": "accessible",
        "definition": "able to be reached or entered."
    },
    {
        "group": 18,
        "word": "acquisitive",
        "definition": "excessively interested in acquiring money or material things."
    },
    {
        "group": 18,
        "word": "amalgamate",
        "definition": "combine or unite to form one organization or structure."
    },
    {
        "group": 18,
        "word": "attenuate",
        "definition": "reduce the force, effect, or value of."
    },
    {
        "group": 18,
        "word": "augment",
        "definition": "make (something) greater by adding to it; increase."
    },
    {
        "group": 18,
        "word": "aversion",
        "definition": "a strong dislike or disinclination."
    },
    {
        "group": 18,
        "word": "blithe",
        "definition": "showing a casual and cheerful indifference considered to be callous or improper."
    },
    {
        "group": 18,
        "word": "contempt",
        "definition": "the feeling that a person or a thing is beneath consideration, worthless, or deserving scorn."
    },
    {
        "group": 18,
        "word": "dawdle",
        "definition": "waste time; be slow."
    },
    {
        "group": 18,
        "word": "deflect",
        "definition": "cause (something) to change direction; turn aside from a straight course."
    },
    {
        "group": 18,
        "word": "discount",
        "definition": "regard (a possibility, fact, or person) as being unworthy of consideration because it lacks credibility."
    },
    {
        "group": 18,
        "word": "dissident",
        "definition": "a person who opposes official policy, especially that of an authoritarian state."
    },
    {
        "group": 18,
        "word": "efficacious",
        "definition": "effective; producing the desired outcome."
    },
    {
        "group": 18,
        "word": "equitable",
        "definition": "fair and impartial."
    },
    {
        "group": 18,
        "word": "erratic",
        "definition": "not even or regular in pattern or movement; unpredictable."
    },
    {
        "group": 18,
        "word": "industrious",
        "definition": "diligent and hard-working."
    },
    {
        "group": 18,
        "word": "inform",
        "definition": "give (someone) facts or information."
    },
    {
        "group": 18,
        "word": "irksome",
        "definition": "irritating; annoying."
    },
    {
        "group": 18,
        "word": "manacle",
        "definition": "a metal band, chain, or shackle for fastening someone's hands or ankles."
    },
    {
        "group": 18,
        "word": "modest",
        "definition": "unassuming or moderate in the estimation of one's abilities or achievements."
    },
    {
        "group": 18,
        "word": "noxious",
        "definition": "harmful, poisonous, or very unpleasant."
    },
    {
        "group": 18,
        "word": "pernicious",
        "definition": "having a harmful effect, especially in a gradual or subtle way."
    },
    {
        "group": 18,
        "word": "predicament",
        "definition": "a difficult, unpleasant, or embarrassing situation."
    },
    {
        "group": 18,
        "word": "proficient",
        "definition": "competent or skilled in doing or using something."
    },
    {
        "group": 18,
        "word": "prolix",
        "definition": "using or containing too many words; tediously lengthy."
    },
    {
        "group": 18,
        "word": "scorn",
        "definition": "the feeling or belief that someone or something is worthless or despicable; contempt."
    },
    {
        "group": 18,
        "word": "subordinate",
        "definition": "lower in rank or position."
    },
    {
        "group": 18,
        "word": "unseemly",
        "definition": "not proper or appropriate."
    },
    {
        "group": 18,
        "word": "veritable",
        "definition": "used as an intensifier, often to qualify a metaphor."
    },
    {
        "group": 19,
        "word": "acolyte",
        "definition": "a person assisting the celebrant in a religious service or procession."
    },
    {
        "group": 19,
        "word": "anoint",
        "definition": "smear or rub with oil, typically as part of a religious ceremony."
    },
    {
        "group": 19,
        "word": "base",
        "definition": "without moral principles; ignoble."
    },
    {
        "group": 19,
        "word": "coercion",
        "definition": "the practice of persuading someone to do something by using force or threats."
    },
    {
        "group": 19,
        "word": "coin",
        "definition": "invent or devise (a newword or phrase)."
    },
    {
        "group": 19,
        "word": "cunning",
        "definition": "having or showing skill in achieving one's ends by deceit or evasion."
    },
    {
        "group": 19,
        "word": "discomfit",
        "definition": "make (someone) feel uneasy or embarrassed."
    },
    {
        "group": 19,
        "word": "dissent",
        "definition": "hold or express opinions that are at variance with those previously, commonly, or officially expressed."
    },
    {
        "group": 19,
        "word": "distill",
        "definition": "extract the essential meaning or most important aspects of."
    },
    {
        "group": 19,
        "word": "dubious",
        "definition": "hesitating or doubting."
    },
    {
        "group": 19,
        "word": "ebullient",
        "definition": "cheerful and full of energy."
    },
    {
        "group": 19,
        "word": "facetious",
        "definition": "treating serious issues with deliberately inappropriate humor; flippant."
    },
    {
        "group": 19,
        "word": "fallible",
        "definition": "capable of making mistakes or being erroneous."
    },
    {
        "group": 19,
        "word": "florid",
        "definition": "having a red or flushed complexion."
    },
    {
        "group": 19,
        "word": "gawky",
        "definition": "awkward or ungainly."
    },
    {
        "group": 19,
        "word": "inveigle",
        "definition": "persuade (someone) to do something by means of deception or flattery."
    },
    {
        "group": 19,
        "word": "jettison",
        "definition": "abandon or discard (someone or something that is no longer wanted)."
    },
    {
        "group": 19,
        "word": "mendacity",
        "definition": "the condition of being untruthful; dishonesty."
    },
    {
        "group": 19,
        "word": "munificent",
        "definition": "more generous than is usual or necessary."
    },
    {
        "group": 19,
        "word": "naive",
        "definition": "showing a lack of experience, wisdom, or judgment."
    },
    {
        "group": 19,
        "word": "noble",
        "definition": "having or showing fine personal qualities or high moral principles and ideals."
    },
    {
        "group": 19,
        "word": "parochial",
        "definition": "having a limited or narrow outlook or scope."
    },
    {
        "group": 19,
        "word": "pedestrian",
        "definition": "lacking inspiration or excitement; dull."
    },
    {
        "group": 19,
        "word": "prevaricate",
        "definition": "speak or act in an evasive way."
    },
    {
        "group": 19,
        "word": "prime",
        "definition": "of first importance; main."
    },
    {
        "group": 19,
        "word": "radical",
        "definition": "favoring or effecting fundamental or revolutionary changes in current practices, conditions, or institutions."
    },
    {
        "group": 19,
        "word": "recrudescent",
        "definition": "breaking out again after a period of dormancy."
    },
    {
        "group": 19,
        "word": "temporal",
        "definition": "relating to worldly as opposed to spiritual affairs; secular."
    },
    {
        "group": 19,
        "word": "transitory",
        "definition": "not permanent."
    },
    {
        "group": 19,
        "word": "viable",
        "definition": "capable of working successfully; feasible."
    },
    {
        "group": 20,
        "word": "abreast",
        "definition": "side by side and facing the same way."
    },
    {
        "group": 20,
        "word": "confound",
        "definition": "cause surprise or confusion in (someone), especially by acting against their expectations."
    },
    {
        "group": 20,
        "word": "digression",
        "definition": "a temporary departure from the main subject in speech or writing."
    },
    {
        "group": 20,
        "word": "discrepancy",
        "definition": "a lack of compatibility or similarity between two or more facts."
    },
    {
        "group": 20,
        "word": "duplicitous",
        "definition": "deceitful."
    },
    {
        "group": 20,
        "word": "expedient",
        "definition": "convenient and practical, although possibly improper or immoral."
    },
    {
        "group": 20,
        "word": "fabricate",
        "definition": "invent or concoct (something), typically with deceitful intent."
    },
    {
        "group": 20,
        "word": "glum",
        "definition": "looking or feeling dejected; morose."
    },
    {
        "group": 20,
        "word": "harbinger",
        "definition": "a person or thing that announces or signals the approach of another."
    },
    {
        "group": 20,
        "word": "intrinsic",
        "definition": "belonging naturally; essential."
    },
    {
        "group": 20,
        "word": "largesse",
        "definition": "generosity in bestowing money or gifts upon others."
    },
    {
        "group": 20,
        "word": "libertine",
        "definition": "a person, especially a man, who behaves without moral principles or a sense of responsibility, especially in sexual matters."
    },
    {
        "group": 20,
        "word": "malfeasance",
        "definition": "wrongdoing, especially by a public official."
    },
    {
        "group": 20,
        "word": "manifest",
        "definition": "clear or obvious to the eye or mind."
    },
    {
        "group": 20,
        "word": "minute",
        "definition": "extremely small; tiny."
    },
    {
        "group": 20,
        "word": "modish",
        "definition": "conforming to or following what is currently popular and fashionable."
    },
    {
        "group": 20,
        "word": "nascent",
        "definition": "just coming into existence and beginning to display signs of future potential; budding."
    },
    {
        "group": 20,
        "word": "perennial",
        "definition": "lasting or existing for a long or apparently infinite time; enduring or continually recurring."
    },
    {
        "group": 20,
        "word": "pious",
        "definition": "devoutly religious."
    },
    {
        "group": 20,
        "word": "providential",
        "definition": "occurring at a favorable time; opportune."
    },
    {
        "group": 20,
        "word": "prowess",
        "definition": "skill or expertise in a particular activity or field."
    },
    {
        "group": 20,
        "word": "schism",
        "definition": "a split or division between strongly opposed sections or parties, caused by differences in opinion or belief."
    },
    {
        "group": 20,
        "word": "slander",
        "definition": "the action or crime of making a false spoken statement damaging to a person's reputation."
    },
    {
        "group": 20,
        "word": "stalwart",
        "definition": "loyal, reliable, and hardworking."
    },
    {
        "group": 20,
        "word": "supplicate",
        "definition": "ask or beg for something earnestly or humbly."
    },
    {
        "group": 20,
        "word": "terse",
        "definition": "sparing in the use of words; abrupt."
    },
    {
        "group": 20,
        "word": "tirade",
        "definition": "a long, angry speech of criticism or accusation."
    },
    {
        "group": 20,
        "word": "universal",
        "definition": "of, affecting, or done by all people or things in the world or in a particular group."
    },
    {
        "group": 20,
        "word": "vanquish",
        "definition": "defeat thoroughly."
    },
    {
        "group": 20,
        "word": "woeful",
        "definition": "characterized by, expressive of, or causing sorrow or misery."
    },
    {
        "group": 21,
        "word": "abject",
        "definition": "experienced or present to the maximum degree."
    },
    {
        "group": 21,
        "word": "amicable",
        "definition": "characterized by friendliness and absence of discord."
    },
    {
        "group": 21,
        "word": "animosity",
        "definition": "strong hostility."
    },
    {
        "group": 21,
        "word": "aver",
        "definition": "state or assert to be the case."
    },
    {
        "group": 21,
        "word": "barrage",
        "definition": "a concentrated artillery bombardment over a wide area."
    },
    {
        "group": 21,
        "word": "cathartic",
        "definition": "providing psychological relief through the open expression of strong emotions; emotionally purging."
    },
    {
        "group": 21,
        "word": "decipher",
        "definition": "convert (a text written in code, or a coded signal) into normal language."
    },
    {
        "group": 21,
        "word": "delusion",
        "definition": "an idiosyncratic belief or impression maintained despite being contradicted by reality or rational argument."
    },
    {
        "group": 21,
        "word": "dispense",
        "definition": "distribute or provide (a service or information) to a number of people."
    },
    {
        "group": 21,
        "word": "eloquent",
        "definition": "fluent or persuasive in speaking or writing."
    },
    {
        "group": 21,
        "word": "enthrall",
        "definition": "capture the fascinated attention of."
    },
    {
        "group": 21,
        "word": "eradicate",
        "definition": "destroy completely; put an end to."
    },
    {
        "group": 21,
        "word": "fledgling",
        "definition": "a young bird that has just fledged."
    },
    {
        "group": 21,
        "word": "fortitude",
        "definition": "courage in pain or adversity."
    },
    {
        "group": 21,
        "word": "fortuitous",
        "definition": "happening by accident or chance rather than design."
    },
    {
        "group": 21,
        "word": "goad",
        "definition": "provoke or annoy (someone) so as to stimulate some action or reaction."
    },
    {
        "group": 21,
        "word": "imminent",
        "definition": "about to happen."
    },
    {
        "group": 21,
        "word": "incontrovertible",
        "definition": "not able to be denied or disputed."
    },
    {
        "group": 21,
        "word": "itinerant",
        "definition": "traveling from place to place."
    },
    {
        "group": 21,
        "word": "magnanimous",
        "definition": "very generous or forgiving, especially toward a rival or someone less powerful than oneself."
    },
    {
        "group": 21,
        "word": "meritorious",
        "definition": "deserving reward or praise."
    },
    {
        "group": 21,
        "word": "mutiny",
        "definition": "an open rebellion against the proper authorities, especially by soldiers or sailors against their officers."
    },
    {
        "group": 21,
        "word": "paradoxical",
        "definition": "seemingly absurd or self-contradictory."
    },
    {
        "group": 21,
        "word": "perseverance",
        "definition": "steadfastness in doing something despite difficulty or delay in achieving success."
    },
    {
        "group": 21,
        "word": "render",
        "definition": "provide or give (a service, help, etc.)."
    },
    {
        "group": 21,
        "word": "repertoire",
        "definition": "a stock of plays, dances, or pieces that a company or a performer knows or is prepared to perform."
    },
    {
        "group": 21,
        "word": "resilient",
        "definition": "able to withstand or recover quickly from difficult conditions."
    },
    {
        "group": 21,
        "word": "resolute",
        "definition": "admirably purposeful, determined, and unwavering."
    },
    {
        "group": 21,
        "word": "supple",
        "definition": "bending and moving easily and gracefully; flexible."
    },
    {
        "group": 21,
        "word": "valor",
        "definition": "great courage in the face of danger, especially in battle."
    },
    {
        "group": 22,
        "word": "arresting",
        "definition": "attracting one's attention; striking."
    },
    {
        "group": 22,
        "word": "chastise",
        "definition": "rebuke or reprimand severely."
    },
    {
        "group": 22,
        "word": "cumbersome",
        "definition": "large or heavy and therefore difficult to carry or use; unwieldy."
    },
    {
        "group": 22,
        "word": "economy",
        "definition": "the wealth and resources of a country or region, especially in terms of the production and consumption of goods and services."
    },
    {
        "group": 22,
        "word": "elementary",
        "definition": "relating to the rudiments of a subject."
    },
    {
        "group": 22,
        "word": "embellish",
        "definition": "make (something) more attractive by the addition of decorative details or features."
    },
    {
        "group": 22,
        "word": "euphoric",
        "definition": "characterized by or feeling intense excitement and happiness."
    },
    {
        "group": 22,
        "word": "exonerate",
        "definition": "absolve (someone) from blame for a fault or wrongdoing, especially after due consideration of the case."
    },
    {
        "group": 22,
        "word": "extrapolate",
        "definition": "extend the application of (a method or conclusion) to an unknown situation by assuming that existing trends will continue or similar methods will be applicable."
    },
    {
        "group": 22,
        "word": "falter",
        "definition": "start to lose strength or momentum."
    },
    {
        "group": 22,
        "word": "fervent",
        "definition": "having or displaying a passionate intensity."
    },
    {
        "group": 22,
        "word": "foment",
        "definition": "instigate or stir up (an undesirable or violent sentiment or course of action)."
    },
    {
        "group": 22,
        "word": "gaffe",
        "definition": "an unintentional act or remark causing embarrassment to its originator; a blunder."
    },
    {
        "group": 22,
        "word": "heterodox",
        "definition": "not conforming with accepted or orthodox standards or beliefs."
    },
    {
        "group": 22,
        "word": "histrionic",
        "definition": "excessively theatrical or dramatic in character or style."
    },
    {
        "group": 22,
        "word": "implicit",
        "definition": "implied though not plainly expressed."
    },
    {
        "group": 22,
        "word": "inviolate",
        "definition": "free or safe from injury or violation."
    },
    {
        "group": 22,
        "word": "liability",
        "definition": "the state of being responsible for something, especially by law."
    },
    {
        "group": 22,
        "word": "obstinate",
        "definition": "stubbornly refusing to change one's opinion or chosen course of action, despite attempts to persuade one to do so."
    },
    {
        "group": 22,
        "word": "painstaking",
        "definition": "done with or employing great care and thoroughness."
    },
    {
        "group": 22,
        "word": "phlegmatic",
        "definition": "having an unemotional and stolidly calm disposition."
    },
    {
        "group": 22,
        "word": "prodigious",
        "definition": "remarkably or impressively great in extent, size, or degree."
    },
    {
        "group": 22,
        "word": "propensity",
        "definition": "an inclination or natural tendency to behave in a particular way."
    },
    {
        "group": 22,
        "word": "qualm",
        "definition": "an uneasy feeling of doubt, worry, or fear, especially about one's own conduct; a misgiving."
    },
    {
        "group": 22,
        "word": "renege",
        "definition": "go back on a promise, undertaking, or contract."
    },
    {
        "group": 22,
        "word": "stinting",
        "definition": "giving or allowing only the smallest amount of something that is necessary."
    },
    {
        "group": 22,
        "word": "temper",
        "definition": "serve as a neutralizing or counterbalancing force to (something)."
    },
    {
        "group": 22,
        "word": "tentative",
        "definition": "not certain or fixed; provisional."
    },
    {
        "group": 22,
        "word": "unprecedented",
        "definition": "never done or known before."
    },
    {
        "group": 22,
        "word": "vivacious",
        "definition": "attractively lively and animated."
    }
]